In [21]:
import pandas as pd
import sqlite3

In [22]:
conn = sqlite3.connect('C:/Tez/Pay_Man_FdeA/main/DB.db')

In [23]:
df_dir = pd.read_sql_query("SELECT * FROM DIRECCIONES;", con=conn)
df_dir

   DIR_ID      CALLE  COSTO  BALANCE
0       1   Real 300    320     -640
1       2   Alta 132    320     -960
2       3  Linda 001    300     -640
3       4  Dulce 002    320    -1280
4       5   Azul 003    320     -640

In [19]:
df_pay = pd.read_sql_query("SELECT * FROM PAGOS", con=conn)
df_pay

   PAY_ID  DIR_ID  PAGO       FECHA
0       1       1   320  2023-02-10
1       2       2   320  2023-01-10
2       3       3   600  2023-02-10
3       4       4   320  2022-12-10
4       5       5   320  2023-02-10
5       6       1   320  2023-01-10
6       7       2   320  2022-10-10
7       8       3   300  2023-01-10
8       9       4   320  2022-11-10
9      10       5   320  2023-01-10

In [20]:
conn.close()